WF/src/InformationRegisters/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Файлы</name>
  <resources>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
      <types>CatalogRef.СписокНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WF/src/InformationRegisters/Файлы/ManagerModule.bsl
Процедура ЗаписьФайлаВбазу(ОбъектЗаписи, ДанныеФайла,РасширениеФайла,РазмерФайла)Экспорт
	АлгоритмСжатия = Новый Сжатиеданных(9);
	ХранилищеСФайлом = Новый ХранилищеЗначения(ДанныеФайла, АлгоритмСжатия);
	ЗаписьФайла = СоздатьМенеджерЗаписи();
	ЗаписьФайла.Объект = ОбъектЗаписи;
	ЗаписьФайла.ДанныеФайла =  ХранилищеСФайлом;
	ЗаписьФайла.РазмерФайла = РазмерФайла;
	ЗаписьФайла.Расширение = РасширениеФайла;
	ЗаписьФайла.Записать(Истина);
КонецПроцедуры

Функция ПолучитьДанныеФайла(ОбъектЧтения) Экспорт
	ЧтениеФайла = СоздатьМенеджерЗаписи();
	ЧтениеФайла.Объект = ОбъектЧтения;
	ЧтениеФайла.Прочитать();
	ДанныеФайла = ЧтениеФайла.ДанныеФайла.Получить();
	Возврат ДанныеФайла;
КонецФункции // ПолучитьДанныеФайла()
